Бух_тест/src/InformationRegisters/НастройкаПечатиНалоговыхДокументов/НастройкаПечатиНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПечатиНалоговыхДокументов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВыводитьНомерДоговораБезКлеточек</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьДатыВНалоговыхНакладныхСРазделителями</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьКодУКТВЭДБезПробелов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СимволПустыхПоказателейВНалоговойНакладной</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/InformationRegisters/НастройкаПечатиНалоговыхДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, ИмяРеквизита, ЗначениеПоУмолчанию)

	Если НЕ ДанныеЗаполнения.Свойство(ИмяРеквизита, ЗаписьРегистра[ИмяРеквизита]) Тогда
		ЗаписьРегистра[ИмяРеквизита] = ЗначениеПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

Процедура УстановкаНастройкиПечатиНалоговыхНакладныхПоУмолчанию(ЗаписьРегистра, ДанныеЗаполнения) Экспорт

	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Период", НачалоГода(ТекущаяДатаСеанса()));
	
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВыводитьНомерДоговораБезКлеточек", 							Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН", 	Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах", 		Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьДатыВНалоговыхНакладныхСРазделителями", 				Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьКодУКТВЭДБезПробелов", 								Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной", 	Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СимволПустыхПоказателейВНалоговойНакладной", 				" ");
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента", 					Ложь);
	
КонецПроцедуры

#КонецЕсли
